{"key": "marrakech", "data": {"name": "Marrakech", "packages": [{"id": "4", "name": "Safari Experience", "description": "Experience the thrill of a safari in the wild.", "location": "Kenya", "destination": "Kenya", "country": "Kenya", "continent": "Africa", "price": {"amount": 1299.99, "currency": "USD", "per_person": true}, "duration": "10 days", "activities": [{"name": "Wildlife watching", "description": "Enjoy Wildlife watching in Kenya", "duration": "3 hours", "included_in_package": true}, {"name": "Guided tours", "description": "Enjoy Guided tours in Kenya", "duration": "1 hours", "included_in_package": true}, {"name": "Photography sessions", "description": "Enjoy Photography sessions in Kenya", "duration": "4 hours", "included_in_package": true}], "coordinates": {"latitude": 1.4419683, "longitude": 38.4313975}, "weather_data": {"daily": {"time": ["2025-05-08", "2025-05-09", "2025-05-10", "2025-05-11", "2025-05-12", "2025-05-13", "2025-05-14"], "temperature_2m_max": [33.3, 33.5, 34.2, 35.4, 36.0, 35.7, 35.6], "temperature_2m_min": [24.0, 23.6, 24.4, 24.0, 25.0, 25.6, 25.5], "precipitation_sum": [2.4, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}}, "local_info": null, "local_attractions": null, "destination_guide": {"title": "Kenya", "extract": "Kenya in East Africa is a pearl in sub-Saharan Africa. From the scenic sandy beaches at the coast, to the Nairobi National Park (the only one in a capital city in the world), to the majestic Rift Valley, the bird life in Lake Naivasha, the hot boiling springs of Lake Baringo, Lake Turkana and Lake Victoria, Kenya is a very beautiful country with lots of wildlife and scenic features, and is one of the major economic hubs in Africa. Fondly referred to the \"Jewel of Africa\", Kenya is a dream destination for its Swahili heritage and the home of humankind and Safari industry.\n\n\n== Regions ==\nKenya is divided into several different regions, each with its own unique characteristics and differences in terms of culture, landscape, climate, and economy:\n\n\n== Cities and major towns ==\nKenya has 3 major cities:\n\n1 Nairobi — the cosmopolitan capital city and economic centre of Kenya and most vibrant in the East African region.\n2 Mombasa — historic port on the Indian Ocean seafront and probably Africa's longest continuously settled town.\n3 Kisumu — the major city to the west, on the shore of Lake Victoria.\nMajor towns based on size and popularity as tourist destination include:\n\n4 Lamu — main town of the Lamu Archipelago, renowned internationally for its annual cultural festival.\n5 Lodwar — in the north on the main route to South Sudan with access to Lake Turkana\n6 Malindi — the landing point of Vasco Da Gama in Kenya with a large Italian population\n7 Meru — town near the base of Mount Kenya.  It is the crossroads for travel to Nairobi\n8 Nakuru — near lake Nakuru National Park and an extinct volcano (Menengai)\n9 Mtwapa - the small town near Mombasa has become a preferred place of residence for European pensioners and is a centre of night life\n\n\n== National parks ==\n\nNorth of Nairobi:\nThese parks, although very interesting and worth visiting, with fewer visitors than the southern parks.\n\n1 Kakamega Rainforest -  last primeval rainforest in the country and home to various monkeys and hundreds of bird species\n2 Aberdare National Park — a cool and cloudy national park with lots of large game, and over 250 species of bird recorded\n3 Sibiloi National Park\n4 Mount Elgon National Park\n5 Lake Nakuru National Park — a stunning 400 species of bird have been recorded here including the largest flocks of flamingos anywhere on earth\n6 Mount Kenya National Park — challenging trekking on high peaks\nSouth of Nairobi:\nThe southern parks are the most visited, especially by those who divide their holidays between a safari and time on the beach.\n\n7 Maasai Mara National Reserve — probably the most popular reserve in Kenya due to the high concentration of big cats\n8 Nairobi National Park — virtually in Nairobi and a great option to see large game for those on a tight schedule\n9 Tsavo East National Park — major game park for short safari trips from the coast\n10 Tsavo West National Park — no. 2 game park for short safari trips from the coast\n11 Amboseli National Park — a swampy lowland Maasai park that is one of the best places anywhere in Africa to view large mammals, especially elephants\nSee also African national parks.\n\n\n== Understand ==\n\nKenya is one of Africa's most visited countries by tourists, and rightfully so - it boasts a diversity of attractions and a well-developed hospitality and tourism sector that most of its neighbors envy. The relative ease of travel, the abundance of tour operators, pleasant year-round climate, natural sights and friendly people all contribute to its relative popularity by African standards.\nAlthough made up of many diverse ethnic groups and tribes, Kenyans have a strong sense of national pride. This may be due in part to their unity in the struggle for Uhuru (Kiswahili: \"freedom\") – independence from British colonial rule, achieved in 1963. While Kenyans can spot ethnic differences among themselves quite easily, to most foreigners these will not be distinguishable. Outsiders on the whole tend to find Kenyans to be relaxed, hospitable, and joyous. Hostility towards foreigners is uncommon; if anything, some visitors may be uncomfortable with the timidity that comes with a perceived dependence on tourist dollars.\nLake Turkana and the area around is also known as the cradle of mankind as many prehistoric fossils have been discovered. Hominid fossils of significant scientific interest have been found in Rift Valley areas such as Olorgesaille, and it is often believed that this area of Africa is where the human species originated from (although recent discoveries in Ethiopia contest that theory).\nEconomically, the Kenyan story is one of two steps forward, one step back, and so on. The country is one of the more developed in East Africa, and the tourism sector has made it easy for visitors to ignore the prevalence of poverty with all-in luxury safari packages – or commoditize it into a quick and questionable slum tour. The success story of the local startup scene contrasts with the persistent struggles of the underclass and pervasive corruption. In urban Nairobi and Mombasa, chic hotels, golf courses and shopping malls coexist alongside anarchic shantytowns. Rural economies in Kenya are still predominantly agricultural, but with real progress in the 21st century. All this offers an opportunity for travellers of all budgets to mix and match experiences. For a general overview read the Wikivoyage article on travel in developing countries.\n\n\n=== Climate ===\nKenya experiences a wide range of tropical climates. It is hot and humid at the coast, temperate inland, and very dry in the north and northeast. It receives a great deal of sunshine all year round and summer clothes are worn throughout the year. However, it is usually cool at night and early in the morning. Nairobi is at high altitude and can be quite cold, even during the day, between June and August.\nThe long rain season is from April to June, and the short rain season October to December. Rain is sometimes heavy and often falls in the afternoons and evenings. The hottest period is February to March, and the coldest July to August.\nGame viewing is best in the dry seasons, which are from mid-June to October, and from late-December to mid-March. The annual animal migration – especially migration of the wildebeest – occurs between June and September, with millions of animals taking part. It has been a popular event for film-makers to capture.\n\n\n=== History ===\nKenya has been inhabited by people since the beginnings of humanity's existence as a species.\n\nArab traders began frequenting the coast of Kenya around the 1st century. Kenya's proximity to the Arabian peninsula invited colonisation, and Arab and Persian settlements spread along the coast in the 8th century. Throughout the centuries, Kenya has played host to many different merchants and explorers (Arabs, Chinese, Portuguese, et al.) Coastal Kenya formed part of the Swahili Coast, which comprised of numerous wealthy city-states that engaged in trade across the Indian Ocean and Sahara Desert, one of the most prominent being the city of Mombasa.\nKenya became part of the British Empire in the late 19th century. In the 1950s, a brutal war took place between independence fighters called the Mau Mau and the British, with horrendous abuses of human rights on both sides. Kenyan nationalist Jomo Kenyatta was arrested in 1952 and with little evidence, tried and imprisoned for supposed management of the Mau Mau Society, eventually being detained for almost 9 years. Considered a national hero, he led the country after it declared independence on 12 December 1963. Through popularity, moderation and shrewd power politics, the Founding Father turned the country into a de facto dictatorship (whether benevolent or malevolent depends on who you talk to).\nWhen President Kenyatta died in 1978, Daniel arap Moi became president and, for better or worse, ruled as a dictator for over two decades. Moi did not hesitate to rough up his political opponents, and a key administrative building in Nairobi, Nyayo House, became infamous for the rumoured torture that occurred in its basement. However, some Kenyans do look back at this time more fondly as a period of stability. Following a wave of popular protests, stepped down more or less voluntarily in 2002 to make way for freely contested elections.\nThose elections were won by Mwai Kibaki, who stayed in office until 2013. Despite genuine economic progress, Kibaki's turn in office was marred by a sense that Kibaki's Gikuyu ethnic group, the country's largest, was consolidating power. This ultimately led to a widespread outbreak of violence in 2007, when his opponent Raila Odinga alleged Kibaki stuffed the ballot boxes to win election. Over 1000 died in the ensuing clashes. Kibaki retained power amidst evidence of tampering on both sides, and with the pre-election polls indicating a razor-thin election, it's impossible to know who the real victor should have been.\nRelations with Kenya's neighbours are generally stable and friendly – except for Somalia, whose disintegration has prompted security concerns in Kenya. Kenya participates in international military missions attempting to defeat fundamentalist group al-Shabab; as a result, al-Shabab has launched several high-profile terrorist attacks in various locations around the country. Kenyans are therefore sometimes mistrustful or hostile towards Somalis, although there are many Kenyans of Somali heritage throughout the country and many others are refugees who fled the country's civil war. Kenya's relations with other neighbors are generally much smoother, and Kenya is a member of the East African Community (along with Burundi, Rwanda, South Sudan, Tanzania, and Uganda) which aims to foster cooperation within the region.\n\n\n=== People and culture ===\nKenya has a diverse population that comprises 47 ethnic communities with a combination of 67% Bantus (Kikuyu, Swahili, Kamba, Luhya, Meru, Abagusii) and 30% Nilotes (Maasai, Luo, Samburu, Turkana and Kalenjin). An important non-indigenous ethnic group are the Indians, who were largely brought over by the British as indentured servants during the colonial period and settled around major cities, and are predominantly business people. There is also a small but prominent white community that dates back to the colonial era, mostly of British descent.\nNotable peoples include the Swahili on the coast, pastoralist communities in the north, farmers in central and western and fishermen around the Lake Victoria basin. The Maasai culture is well known to tourists, despite their being a minor percentage of the Kenyan population. They are renowned for their elaborate upper body adornment and jewellery.\n\n\n==== Swahili culture ====\nSwahili culture is a blend of various influences from the East African coast, including African, Arab, and Indian cultures. It is predominantly found in Kenya, Tanzania, and parts of Uganda, Mozambique, and the Democratic Republic of Congo. Here are some of the key aspects of Swahili culture:\n\nLanguage – Swahili is the most widely spoken language in East Africa, and is a key marker of Swahili culture. It is a Bantu language with significant Arabic, Persian, and Indian loanwords.\nReligion – Swahili culture has a strong Islamic influence, with many Swahili people being Muslims. However, there is also a significant Christian population.\nFood – Swahili cuisine is a fusion of African, Arab, and Indian influences, with dishes such as pilau (spiced rice), biryani, samosas, and chapati being popular. Coconut milk and spices such as cardamom, cumin, and cinnamon are often used to flavour dishes.\nMusic and dance – Swahili music is diverse and includes taarab, a form of music that originated in Zanzibar and blends African, Arab, and Indian styles. Traditional Swahili dances include the chakacha, a sensual dance performed by women, and the ngoma, a high-energy dance performed by both men and women.\nArt and architecture – Swahili art includes intricately carved wooden doors and furniture, colourful textiles, and woven baskets. Swahili architecture is known for its ornate designs and the use of coral stone and lime mortar in building structures.\nTraditional dress – Swahili traditional dress includes the kanga, a colorful piece of cloth worn by women, and the kanzu, a long tunic worn by men.\nHospitality and community – Swahili culture places a strong emphasis on hospitality and community, with extended families and neighbors often playing a key role in daily life. Social gatherings such as weddings, funerals, and religious celebrations are important events that bring people together.\n\n\n==== Maasai culture ====\nMaasai culture is a distinctive and traditional culture of semi-nomadic people who live in parts of Kenya and Tanzania. Here are some of the key aspects of Maasai culture:\n\nLanguage – The Maasai people speak Maa, a Nilotic language.\nDress – The traditional dress of the Maasai people includes brightly coloured shukas (cloths) and beaded jewellery. Men typically wear a red shuka while women wear more colourful shukas. The Maasai are known for their distinctive style of beadwork, which is used to make intricate jewelry, belts, and other items.\nLivelihood – The Maasai people are primarily pastoralists, who rely on their cattle for food, milk, and income. They are known for their ability to live harmoniously with wildlife and have a deep respect for nature.\nSocial organization – The Maasai are organized into age-sets, which are groups of people who are born within a specific time period. These age-sets play an important role in Maasai social and political life, and each age-set has its own duties and responsibilities.\nReligion and beliefs – The Maasai have a monotheistic religion that revolves around a single god named Enkai or Engai. They also have a strong belief in spirits and the power of diviners and medicine men.\nInitiation – Initiation is an important rite of passage for Maasai boys and girls. Boys undergo a circumcision ceremony and then spend several years in warrior training, while girls undergo female genital mutilation and are then considered ready for marriage.\nMusic and dance – Maasai music and dance is an important part of their culture, and is often performed at social gatherings and ceremonies. Maasai music is characterized by high-pitched chanting and vocal harmonies, accompanied by percussion instruments such as drums and rattles.\nDespite the challenges faced by Maasai people in adapting to modernization and globalization, they have managed to maintain their distinctive cultural identity and way of life.\n\n\n=== Economy ===\nKenya is a developing country, with an emerging market economy mostly from its sources of transport infrastructure. Its major agricultural exports are coffee, tea, roses and vegetables. In recent times, Kenya has generated its electricity on renewable resources, mainly geothermal energy.\n\n\n=== Flora and fauna ===\nKenya is home to a diverse range of flora and fauna, thanks to its varied geography and climate. Here are some of the notable examples of flora and fauna found in Kenya:\nFlora:\n\nAcacia trees: These trees are a common sight in Kenya's savannahs and are an important food source for giraffes, elephants, and other herbivores.\nBaobab trees: These iconic trees can be found throughout Kenya and are known for their distinctive shape and large size.\nMount Kenya Afro-alpine zone: This high-altitude region is home to a variety of unique plant species, including giant lobelias and groundsel trees.\nMangrove forests: These coastal forests provide important habitat for a variety of marine life, including crabs, fish, and birds.\nFauna:\n\nThe Big Five: Kenya is known for its large mammals, which include elephants, rhinos, lions, leopards, and buffalo. These animals are considered the \"Big Five\" and are a major draw for tourists.\nWildebeest migration: Each year, millions of wildebeest migrate across the Serengeti plains, crossing into Kenya's Maasai Mara National Reserve.\nEndangered species: Kenya is home to a number of endangered species, including the Grevy's zebra, the black rhino, and the African wild dog.\nBirdlife: Kenya is a paradise for bird lovers, with over 1,000 bird species found in the country. Notable species include flamingos, ostriches, and the African fish eagle.\n\n\n=== Holidays ===\nNew Year's Day (January 1)\nEaster (Good Friday and Easter Monday)\nLabour Day (May 1)\nMadaraka Day (June 1)\nEid al-Fitr (variable) Islamic religious observances\nMashujaa Day (October 20)\nJamhuri Day (December 12)\nChristmas (December 25)\nBoxing Day (December 26)\n\n\n=== Tourist information ===\nMagical Kenya website\n\n\n== Talk ==\nSee also: Swahili phrasebook\nEnglish and Swahili are the two official languages. As a diverse country with over 40 ethnic groups and 60 languages between them, most Kenyans are multilingual, speaking their native ethnic language along with Swahili, which is the preferred language for interethnic communication. Most people, particularly in urban areas, also have a working knowledge of English, though this will vary depending on their level of education. Efforts to communicate in Swahili are generally greatly appreciated by Kenyans and can become increasingly useful in more rural areas where English speakers are less prevalent.\n\n\n== Get in ==\n\n\n=== Visa ===\n̈From 1 January 2024, Kenya abolished visa requirements for all foreign visitors and instead moved to single entry Electronic Travel Authorization (ETA). All countries apart from the countries of the East African Community will need to apply for a ETA to enter Kenya. The ̊ETA costs US$34.09. A few countries will get the ETA for free.\n\nHolders of single-entry ETA can re-enter Kenya without a new ETA if they have only gone to EAC Partner States: Burundi, Democratic Republic of Congo, Rwanda, South Sudan, Tanzania and Uganda and declare it upon re-entry to Kenya with proof of passport stamps. When you re-enter, make sure to do it within the time frame you were given on arrival in Kenya. Ask for the full 90 days on arrival.\nPlastic bags are forbidden in Kenya. The ban on the import of plastic bags also applies to tourists. There are strict penalties. Plastic bags in your baggage are to be handed in upon arrival in Kenya.\n\n\n=== By plane ===\n\nKenya Airways (KQ) is the national airline, and one of the largest airlines in Africa. KQ has extensive regional (e.g. to Capetown, Johannesburg, Harare, Cairo, Entebbe, Accra) and international connections (e.g. to Bangkok, Dubai, London, Amsterdam, New York City, Mumbai). It is also a SkyTeam associate member.\nKenya has three international airports:\n\nJomo Kenyatta International Airport (NBO IATA) in Nairobi. Approximately twenty minutes from the main business district.\nMoi International Airport in Mombasa.\nEldoret International Airport (local flights and cargo only).\nJomo Kenyatta is the primary arrival point for visitors flying into Kenya. There are excellent flight connections provided by KQ to major tourist destinations such as Mombasa, Kisumu and Malindi.\nAirlines that serve NBO are: Air Arabia, African Express Airways, Air Mauritius, Lufthansa, British Airways, Brussels Airlines, China southern airlines, Condor Airlines, Egypt Air, Emirates, Ethiopian Airlines, Etihad Airways, Fly Sax, Kenya Airways, KLM Royal Dutch, LAM Mozambique airlines, Jubba airways, Precision Air Tanzania, Qatar Airways, Saudi Arabian Airlines, South African Airways, RwandAir, Swiss International Airlines, Turkish Airlines, Jambo Jet.\nMore airlines are flying to Kenya, and Nairobi's Jomo Kenyatta International Airport has become a hub for East and Central Africa. Kenya Airways (among others) also provides direct flights from Nairobi to several West African countries, e.g., Lagos in Nigeria, Bamako in Mali, as well as direct flights to Bangkok and connections to Hong Kong and China.\n\n\n=== By train ===\nIt is not possible to enter or leave Kenya by train as of 2024. Kenya Railways have however stated their intent to revive the existing colonial network to the border of Uganda and Tanzania, opening the possibilities of international travel in the near future.\n\n\n=== By car ===\nMajor roads are typically paved with various states of maintenance though secondary roads outside of urban areas are typically unpaved. All neighbouring countries can be accessed by road, including Ethiopia via the border town of Moyale, Uganda via Busia or Malaba, and Tanzania via Namanga or Lungalunga. Turkana, Marsabit, Moyale, Mandera, Garissa, Isiolo, and some parts of Ijara are considered insecure and prone to banditry and terrorist attacks from Somalia. Before driving to the northern region, ensure you check whether there are any security advisories or whether you need to prearrange security escort.\n\n\n=== By bus ===\nRegular bus services operate between:\nNairobi (Kenya) & Arusha (Tanzania);\nNairobi (Kenya) & Kampala (Uganda);\nMombasa (Kenya) & Dar es Salaam (Tanzania);\nKisumu (Kenya) & Kampala (Uganda);\n\nModern coast express has buses from\nNairobi to Dar es Salaam.\nNairobi to Kampala.\nNairobi to Jinja.\nNairobi to Kigali.\nNairobi to Arusha.\nNairobi to Moshi.\nNairobi to Mwanza.\nMombasa to Dar es Salaam.\nMombasa to Tanga.\nKisumu to Kampala.\n\n\n=== By boat ===\nThis is limited to the coastal area, e.g. cruises from Zanzibar to Mombasa.\n\n\n== Get around ==\n\n\n=== By plane ===\nMost international visitors will arrive through Jomo Kenyatta International Airport (JKIA) in Nairobi (NBO). If you are already in Nairobi and need to get to the airport, plan at least two hours to get there as the main road to the airport is subject to heavy traffic jams, and security checks are tedious.\nKenya Airways (KQ) offers the most scheduled connections from JKIA and regular daily flights to the following destinations: Mombasa, Malindi, Lamu and Kisumu. Check in is 45 minutes before departure for local flights and two hours for international. Pay attention to the announcements while in Unit 3 of JKIA as passengers on different flights are put in the same waiting area. If you are flying from another destination to Nairobi and using Kenya Airways in the tourist high season (July–September, December–February), KQ flights are frequently delayed and preference is given to international connecting passengers, platinum frequent-flyer card holders, and first-class passengers. Domestic flights operated on Embraer E190 Aircraft.\nJambojet is a low-cost, no-frills airline also flies from JKIA and offers scheduled connections to Mombasa, Malindi, Lamu, Kisumu, Eldoret, Ukunda (Diani). Plans to extend the service to the East African region are underway. Jambojet now fly from Uganda. A one-way flight to Mombasa from Nairobi can cost as little as Ksh 3500 depending on the timing (checked luggage requires an additional fee). Tickets can be booked online and paid for with Visa and Mastercard. The airline's Domestic flights operated on Bombardier Dash 8 Q400 Turboprop Aircraft.\nAirkenya, Safarilink, Skyward Express have fights from Wilson Airport Nairobi to Ukunda/Diani, Malindi, Lamu, Amboseli National Park, Maasai Mara, Meru, Nanyuki and Samburu. The lounge features a Dormans cafe. Check in can be done up to 15 minutes before departure. Wilson Airport was once the busiest airport in Africa outside South Africa and still remains a major hub for local flights to the nature reserves in Kenya and to cities in neighbouring countries. Anyone using Airkenya is advised to lock their checked-in bags. Things have been known to go missing from luggage while in the care of Airkenya.\nMost charter tourists fly directly to either of the coastal airports of Mombasa or Malindi.\n\n\n=== By bus ===\nKenya has a network of long-distance bus lines. Speed is limited to 80 km/h, and the highways can be very bumpy and dusty, so be sure to pick a comfortable and reputable coach company such as Modern Coast for the long journeys.\nLocal buses in town are run by private companies, such as the green and yellow Citi Hoppa, which provide transportation along various routes for Ksh 50–100. They have regular services in and out of the Nairobi city suburbs. They usually seat 20–35 passengers (no standing passengers are allowed by law) and are a cleaner and less hectic mode of transport than matatus, while still plying many of the same routes.\n\nGuardian Coach\nModern Coast\n\n\n=== By matatu ===\n\nMatatus are privately operated minibuses, typically for 14 or 25 passengers and operating over short and medium distances. They provide a very cheap and quick method of transport in all the major towns and many rural areas. The name matatu comes from the Kiswahili word for the number three – tatu – because some time ago the standard fare was three ten-cent coins. Matatus operate along set routes, picking and dropping off passengers at any point along the way. Most rides within cities cost Ksh 40–100.\nMany matatus are poorly maintained and many are to be found with a fascinating and colourful décor — usually global icons in sports and music, designer brands, et al. — which is a major feature of Kenyan urban culture. Travel by matatu can be risky as the vehicles are often extremely badly driven, with matatu drivers swerving in and out of traffic and stopping at a moment's notice by the side of the road for passengers. Matatus used to be usually packed to well over capacity – up to 25 people in a 14-seater vehicle. It is strongly advised not to take matatus at night, as they are known targets for robberies, in addition to the increased risks of reckless night driving.\n\n\n=== By train ===\nPassenger trains are making a comeback in Kenya with the new railway line, often referred to SGR (short for standard-gauge railway), linking the capital Nairobi with the port city of Mombasa. The line is fully operational with three trains in each direction every day, journey time is about five hours. There is also an SGR line from Nairobi to Naivasha which opened in late 2019.\nTrains are branded as Madaraka Express and are operated by Kenya Railways. There is one Express train and two Inter-Country, with the latter making more stops along the route. As of 2024, tickets for the full journey are Ksh 4,500 for first class and Ksh 1,500 for second. Tickets can be bought at their dedicated website. While the trains operate at semi-high speed, stations are often far from the city centre. In Nairobi and Mombasa, travel time from the city centre to the station is up to one hour.\nThe old colonial metre-gauge railway network (often referred to as MGR) is being rehabilitated too. While this network is considerable slower compared to SGR (and even intercity buses!), fares are very cheap and the routes are scenic. There's an 2 x weekly train between Nairobi and Nanyuki via Nyeri, departing from Nairobi on Tuesday and Fridays and from Nanyuki on Wednesday and Sundays. Journey time of about six hours. the 3rd class ticket is now 400. Also, there are 1x weekly trains between Nairobi and Kisumu, departs Nairobi Friday. departs Kisumu Sunday on the shores of Lake Victoria. a 3rd class ticket is now 900.\nKenya Railways have stated their intent to revive the network to the border of Uganda and Tanzania too, opening the possibilities of international travel in the near future.\n\n\n=== By taxi ===\nRegular taxis are safer than matatus and some think they should always be used, especially at night. Always negotiate the price before the trip. You can calculate about €1/km.\nDriving services have overtaken traditional taxis for tourists as they are cheaper and you can see the fare beforehand in the app. The following are the most anticipated providers:\n Bolt. Includes many towns. (updated Jan 2024)\n Uber. Works in Nairobi. (updated Jan 2024)\nLittle Provide services related to food, transportation etc.\nTuktuk: They run everywhere in the city centres (except Nairobi) or hotel areas on the coast. These are motorized tricycles or rickshaws like in India, cheap, comfortable and airy, fun and the best way to get around the city centre. Just stretch out your arm and one of what feels like a million tuktuks will stop. Also the best way to get to know a city, every driver will like to \"take a lap\". Negotiate price! Price approx. €0.5/km\nMotorbike taxi: There are also Boda-Boda, that is, young men with their small motorbikes, mostly by the dozen waiting for customers on the coast or at intersections, hotel driveways, shopping streets, in front of bars and restaurants. An alternative to taxi for short trips and during the day, not recommended at night or over longer distances. You should be aware that this is by far the most dangerous type of transport. Avarice can easily end here in the hospital. If you are staying in Kenya for a longer period of time, it is worthwhile to have one or two permanent Boda drivers you can trust and whom you can always fall back on. Price approx. €0.25/km\n\n\n=== By rental car ===\nMost worldwide rental agencies have offices in Nairobi, Mombasa and Kisumu, and these offer reliable cars with a full back-up network. One can also rent cheaper cars from local distributors who are mostly reliable. However it is always good to do a background check before sending in a deposit. When you hire a car, no matter the brand name, always take note of the various dents, or states of the car as it may prove contentious especially when a \"refundable\" deposit was involved.\nWhen it comes to renting a car for a safari, consider booking a customized vehicle driven by a local tour driver-guide, provided by a Kenya-based tour operator. The reason is that the road conditions in Kenya will pose a major challenge to anyone used to the high standards of quality roads and standards of driving in the West or parts of Asia as well. Roads, even national highways in some cases are in a state of disrepair, may have potholes, unmarked speed breakers (particularly dangerous) and a lack of road signs or directions. It is the general consensus even among Kenyans that standards of driving and road safety in Kenya are deficient and the country has a high rate of serious accidents. Renting a safari vehicle with a trained driver~guide is often not that expensive and this service is offered by companies in Kenya such as Shoor Car Rental and Market Hire.  There are two types of safari vehicles: the less costly minibus (tour vans) and the 4x4 Toyota Land Cruiser models which cost more but are larger and have four wheel drive. Both vehicle types have game viewing roofs and the minibus is suitable for travel to most destinations except those that may have involve rough or muddy road travel.\nIt is quite convenient to hire a car online and pick it up at the airport once you arrive. The minimum driving age in Kenya is 18 years and for you to hire a vehicle, you may be required to be at least 23 years and have a minimum of 2 years driving experience. Other rules to comply with are: drive on the left side of the road, talking on a hand-held phone is prohibited, seat belts are mandatory and drivers must always carry a valid driver's license. Make sure that the car you are hiring has up-to-date comprehensive and PSV insurance which are normally displayed on the top left side of the windscreen. When hiring a car for cross-border travel you might need to purchase additional insurance and carry the motor vehicle original log book.\nThe Nairobi CBD is traffic prone and it is difficult to find parking on working hours. If you can, avoid going to the CBD on weekdays. However, roads out of the city are relatively easy to navigate and pleasant. Kenya has a lovely countryside and most of the roads linking the major towns are in good condition. Smaller roads however may be dilapidated and you might need to rent a 4X4 to get you there. A good map is essential, and if you are self driving to game parks and the like, a GPS would be very useful - sign posts are rare and you are never quite sure if you are on the correct road, leading to many wrong turnings and backtracking.\nSome car rental companies provide free extras like a mobile phone with a local number. Other extras that are available at a cost are additional GPS, child seats, camping equipment, rooftop tent and a driver.\nMost car rental companies offer cars of all sizes with Japanese models being dominant. All reservations can be made in English with some rental companies providing reservations in French, German, Chinese and Spanish. International car rental companies such as Europcar, Sixt, Budget, Avis and Hertz offer car rental in Kenya. Local car rental companies like Hire N' Drive & Elite Car Rental Kenya are usually very competitive and professional.\n\n\n== See ==\n\nIn Kenya, nature is the main attraction. The cities offer little really worth seeing, apart from the lively and chaotic city life.\nKenya has some of the world's best game reserves where you can go for a safari, and see some of the finest African flora and fauna. The parks are famous for lions, giraffes, elephants and huge herds of zebras, wildebeests and buffaloes. It's wise to shop around for tour operators before picking one, to see what's on offer, who you vibe with, and to get a competitive price.\nThe annual wildebeest migration (from Maasai Mara to the Serengeti) is an awesome sight and best experienced in a balloon safari. Bookings to watch the migration are best done months in advance due to the high demand and limited lodging available in the Mara. Migration is during August and September.\nKenya also is a great destination for beach holidays, with several located along the coastal regions and the city of Mombasa, especially Diani Beach. Other coastal towns worth visiting include Lamu and Malindi.\nKenya is also becoming a golf holiday destination, thanks to the many beautiful lush courses around the major urban areas including some which have hosted international Golf tournaments such as Muthaiga and Karen Golf Courses. Outside of Nairobi there is the well known Limuru Golf Club and the Great Rift Valley Golf Resort close to Lake Naivasha. Green fees range from US$15–60 per round, plus a US$5–7 caddy fee for 18 holes.\nThe northern parts of Kenya are home to some spectacular tribes living very traditional lifestyles - you can start to encounter these remarkable societies near to and around the main road north into Ethiopia (the A2 which runs through Marsabit and into Moyale at the Ethopian border), as well as west of this in places such as Wamba, Maralal, Baragoi, Korr, Kargi, and South Horr.\nKenya has sites from the independence era and the Nairobi National Museum is a good place to learn about the country's rich heritage and recent events in history.\n\n\n== Do ==\nBeaches: Travel organizations usually offer beach holidays at South Coast or North Coast, which simply means south or north of Mombasa. While the South Coast (Tiwi Beach, Diani Beach, Galu Beach, Gazi Beach, Msambweni Beach, Mwazaro Beach) has the nicer beaches and more primordial nature the North Coast near Mombasa (Njali Beach, Bamburi Beach, Shandzu Beach, Mtwapa Beaches, Kikambala Beach) offers much more activities. The beaches further north (Kilifi, Watamu, Malindi) are like South Coast, primordial and tranquil, not as long and broad as Diani Beach but even more photogenic.\n\nIf you want to spend some time in the urban social scene, you might consider attending music and cultural events such as Blankets and Wine, which features international and local artists performing in a picnic-like setting for families and friends looking to enjoy African talent. The event happens on the first Sunday of every month in Nairobi.\nRift Valley Festival, which incorporates a camping experience with a sample of cultural and musical tastes from around the country and internationally.\nSamosa Festival is an event set up to integrate the Asian and African cultures in the country. A significant percentage of the urban population is of Asian (Indian) ancestry and has existed since before independence. Their immigration was brought on by the construction of the railway. This event features cuisine from both cultures, poetry and literature (spoken and written), music and games.\nMaulid festival is a one-week event that can only be enjoyed in the Coastal region, specifically in the ageless town of Lamu, which has the majority of the population of Muslim faith. It is the one event which everyone from the region looks forward.\nThe three major cities have an array of nightclubs that play local and international music. Though the experience may be thrilling, it would be wise to visit in the company of a guide or a trusted local, as like any other country with a nightlife, nightclubs may attract untrustworthy party-goers and \"clubbers\", but this shouldn't ruin your experience as nightclubs are also great places to meet singles and new friends.\nBe respectful to local communities. Carry a consent form to take and publish pictures, always ask before taking pictures.\nHaggle, but do not over-haggle.\n\n\n=== Safaris ===\nSafari: Watch a wildlife migration in one of the national parks. Go for a game drive in many parks and reserves found in the country. If you are on a tight schedule take a game drive in the Nairobi National Park, less than 20 minutes drive from Nairobi's central business district. Major attractions: big cats including lions and leopards, buffaloes, a variety of antelope species, baboons, and monkeys, among others.\nMost vacationers who come to Kenya want to combine the beach with a safari tour. Safaris are never cheap, as the entry fees are high and the camps are usually luxurious. Cheap mass tourism is also undesirable as it would endanger the animals. You shouldn't visit too many parks in a short time, otherwise too much time is wasted on transportation. Less is more here.\n\nBest travel time for safaris: The time of the great animal migration depends on the annual rainfall and can be subject to large fluctuations. The best chances to experience the great migration are in the months of July to September. In the off-season after the rainy season (May - June) the grass is tall and the animals are sometimes more difficult to see, except for elephants and giraffes. On the other hand, nature has fresh colours and the safaris are cheaper. In the high season August–September the grass is short and the sight of animals is easier, but also more expensive.\nGetting there: If you want to visit the Masai Mara National Reserve, it is financially worthwhile to travel to Kenya via Nairobi to save the high costs of the flight from the coast to Masai Mara and back. Or, if you have enough time and want to keep costs down, you can start the safari tour from the coast by car to Tsavo, Amboseli, Nairobi, Naivasha, Masai Mara and then back to the coast by plane or train from Nairobi. The best combination of a beach holiday with a safari when arriving via Mombasa are the Tsavo Parks, which can be reached inexpensively by safari vehicle.\nClothing on safari: Maasai Mara is cooler than Tsavo Parks and Amboseli, sometimes below 10 °C in the morning and safari vehicles are usually open. From 9AM, it gets very warm, so a T-shirt and shorts are enough. That is why the \"onion look\" is recommended, for example zip-off pants, T-shirt and fleece jacket and a \"multifunctional scarf\" (as a headband against blowing hair when the jeep is open, as a hat when it is cool in the morning, as a scarf when it is too windy in the open car or because of the air conditioning and as sun protection for the head), possibly also hat or cap and gloves for sensitive people. It is also important to have sunscreen, sunglasses, mosquito repellents and enough batteries, as the electricity in the lodges is sometimes switched off overnight. Light shoes or flip-flops (to get on the seat). Getting out of the car is only possible for a short time, if at all, and not wandering around anyway. In the evenings at camp, a fleece jacket and a jogging suit are comfortable. In Tsavo and Amboseli, short clothing plus a windbreaker, multifunctional cloth, mosquito and sun protection, sunglasses and spare batteries are sufficient. In the evening, if you want to stay seated a little longer, a jogging suit and windbreaker are sufficient.\n\n\n==== Booked safaris ====\nThere are a number of reputable travel agencies on the coast or in Nairobi who organize safaris and have great experience.\nThere are also illegal providers who work without a license and are cheaper. For your own safety you should give preference to the legal ones. For personal safety, the company should properly maintain and insure its vehicles and have an operating license. Good companies usually have their own office and the vehicles have a company logo that clearly identifies the minibuses and off-road vehicles as company vehicles. For such safari operators, scams are much more difficult because they are easy to track. Company signs on the vehicles should be firmly mounted and not be interchangeable with a handle for the next car, as illegal providers like to do.\nIf you want to book via the Internet with the local safari providers, e.g. at Diani Beach (which is advisable because of the good local knowledge), you should inquire about several providers, because each company either works with different hotels or receives different conditions at the respective hotel . The prices depend heavily on the time of year, the hotel and the means of transport to the game drive. Camps in the park are more expensive than those outside. A lot of time is lost for the arrival and departure, and there are fewer opportunities to see animals on the game drive. Safaris in which you are accommodated in a minivan with 6 others are cheaper than if you are traveling with a few in an off-road vehicle. Individual trips are significantly better than group trips in a narrow minivan. During animal migration, prices are at the highest level. For good offers, it is necessary to choose the travel time, the number of people, the accommodation in the respective park, the number of days you want to stay in the respective park and the type of transport jeep or minivan.\n\n\n==== Safaris on your own ====\nSafaris are traditionally always expensive. Anyone who is not in good financial shape or is not a fan of organized tours will consider going on a safari on their own. There are a few things to consider.\n\nImportant: Basically, you should only consider this if you have experience in Africa, can cope with the chaotic traffic and the often ailing technology of the rental vehicles. Experience with the behaviour of the very dangerous large game animals is also essential.\nTransport and rental cars: You should start from Nairobi if you can. The distances to the parks are shorter than from Mombasa. It is easy to drive north especially and you save yourself the dangerous Mombasa – Nairobi Highway. In addition, the range of reasonably suitable rental vehicles in Nairobi is better than on the coast. The top rule on the Mombasa Highway is: Give in and think along. If necessary, there are run-off areas that you can use if someone overtakes without paying attention to oncoming traffic. But it should be clear that it is quite exhausting for the driver. You have to like driving a car and see it as an adventure. And: something always breaks on the car on a safari. You always get help, but you have to have the nerve to deal with that. You are allowed to drive yourself in all national parks! Likewise in the Mara Reserve, not in some Mara Conservancies.\nOrientation: Google Maps works generally quite good in cities and on country roads. It's almost useless in the parks themselves.\nAnimal sightings: As a self-drive, it will take significantly longer to find the animals. You have to pay the considerable fees per day for the park also as a self-driver. If you want to see a lot in a short period of time, you should hire a local guide who is knowledgeable about the area and who is often even better than a driver from the coast.\nGuides: For the Tsavo Parks, Nakuru and Amboseli you don't need a guide, in the Samburo Park you might need a local guide and in the Masai Mara it is essential. You ask about this directly when booking the accommodation. Good guides don't just stand at the park entrances.\nSafari Card: You have to organize entry to the park. It's not difficult, but you need some information. You can't just go there, as most gates have to be paid in advance or only via Mpesa.\nCamping: Almost all camps are not fenced and some live monkeys and baboons who like to help themselves and have no respect for whites. Most of the campsites there are need to be pre-booked and prepaid. There is almost no infrastructure. You should have the right people with you when camping. The wrong treatment of wild animals can quickly result in disaster.\n\n\n== Buy ==\n\n\n=== Money ===\n\nThe currency is the Kenyan shilling, denoted \"Ksh\" or by \"/-\" following the number (ISO code: KES). It can be divided into 100 cents, though the smallest denomination in circulation is the 1 shilling coin.\nCoins in Kenya come in denominations of 1-, 5-, 10 and 20 shillings. Two series of coins are in circulation, one featuring an image of President Mzee Jomo Kenyatta and the current issue featuring Africa's recognisable animals. Banknotes in Kenya come in denominations of 50-, 100-, 200-, 500 and 1,000 shillings.\nNext to cash, Mpesa (phone transactions) is the most popular payment method and much more common than debit or credit cards. Cash can be topped up or withdrawn in various shops.\n\nATM networks in Kenya with no withdrawal fee (January 2024): Ecobank, Co-operative Bank, NCBA, GT Bank, Sidian Bank, DTB, I&M, National Bank.\nATM networks in Kenya with withdrawal fees of Ksh 400–700: Standard Chartered, ABSA, Stanbic, Equity, Bank of Africa, KCB, Family bank.\nATMs accept Mastercard, visa card, American Express, JCB, Diners Club, Union Pay and Discover cards.\n\n\n=== Shopping ===\nKenya is famous for many handicrafts, which are often the signature of a particular tribe or region. Look for Kisii stone (soap stone) carvings, Maasai jewellery, Mkonde wood carvings, Lamu chairs and batiks. The largest selection of handicrafts can probably be found at the Maasai Market which rotates and can be found at different locations within Nairobi.  For example, on Sundays, they are located  at Yaya Centre near Hurlingham, and on Saturdays, they can be found at the central business district near the law courts parking space.\nOn Fridays, they are at the Village Market in Gigiri, near the UN headquarters. Gigiri, like Yaya Centre, is a plush suburb, so vendors price their goods accordingly. There is also a fine selection of stores selling craft goods in Mombasa, where the atmosphere is somewhat more relaxed. However, the best prices can be found by buying directly from the artisans in their villages in the countryside.\nApart from the typical souvenirs such as wood carvings, it may be a good idea to buy one of the large books with photos of wildlife, nature, or culture. Do listen to and buy some local Kenyan music. Reggae is a very popular genre of music here.\nDo note that merchants are open to bargaining. They will most often raise the price significantly for foreigners, so do not be afraid to haggle.\n\n\n== Eat ==\nThe cuisine of Kenya is influenced by the country's geography, climate, and diverse cultural heritage. Here are some key features of Kenyan cuisine:\n\nStaple foods: Ugali, a maize-based porridge, is the most common staple food in Kenya. It is often served with stews or sauces made from meat, vegetables, or beans. Other popular staples include rice, chapati (a type of flatbread), and sukuma wiki (a leafy green vegetable).\nMeat dishes: Beef, chicken, and goat are the most commonly consumed meats in Kenya. Popular meat dishes include nyama choma (grilled meat), samosas (deep-fried pastry filled with meat or vegetables), and biryani (a spiced rice dish with meat or vegetables).\nSeafood: Kenya's long coastline means that seafood is also an important part of the cuisine. Popular seafood dishes include grilled fish, prawn curry, and seafood stew.\nVegetables: Kenya's fertile soil means that vegetables are plentiful and varied. Common vegetables used in Kenyan cuisine include kale, cabbage, spinach, tomatoes, and onions.\nSpices: Kenyan cuisine is known for its use of spices, including cinnamon, cardamom, ginger, and turmeric. These spices are often used to flavor meat dishes and stews.\nTea and coffee: Kenya is a major producer of tea and coffee, and both beverages are an important part of Kenyan culture. Kenyan tea is typically strong and sweet, while Kenyan coffee is known for its rich, fruity flavor.\n\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\n\n== Drink ==\nKenya has several local beer brands, the most popular being Tusker. Imported beers are generally available in higher-end establishments.\nImported and local wines and spirits are widely available, though it is advisable to avoid local brews such as \"changaa\" and \"busaa\", which are often illegal, unhygienically brewed, and whose consumption has led to deaths on many occasions.\nSoft drinks, especially from Coca-Cola, are widely available, and the strong, locally produced Stoney \"Tangawizi\" ginger ale is fantastic.\nMost bars and small shops will expect you to leave behind your glass bottles so they can return them to their distributors.\n\n\n== Sleep ==\n\nNairobi has a wide variety of tourist hotels, from backpackers hostels to five-star establishments such as the Norfolk Hotel. As long as you don't mind basic accommodations, there is no need to spend more than US$100 per night on a hotel or hostel. In addition, the international Intercontinental and Hilton chains are also represented as well as a number of very highly regarded local chains (Serena and Sarova Hotels). Small boarding and lodging establishments are ubiquitous in central urban areas for low cost, although these are rarely safe as they are located in high crime areas.\n\nGuest houses often offer the best value for budget minded travellers. In small towns or villages, lodging can be found for less than Ksh 1,000. The most simple guest houses have shared bathrooms and start at as little as Ksh 500/night--though often of questionable cleanliness and not entirely bug-free. Private, 'self-contained' rooms go for Ksh 500-1000 and often can be rented at bars or clubs (expect a noisy night).\nHomestays are increasingly gaining popularity. Part of the reason is that one can experience Kenyan culture in a deeper and more meaningful way. Most homes charge about US$20 per night inclusive of meals. Some may include laundry on that price.\nPeople staying longer-term may rent accommodation; prices range from estate-agent 'international style' rentals US$150 per week, to privately arranged furnished apartments, US$50–100 pw, to 'local' style accommodation, usually unfurnished, in a price range from Ksh 5,000-7,000 per month with windows, water, electricity, down to Ksh 500 per month with no windows, no electricity, loud neighbours, mosquitoes, and shared access to a tap. To arrange privately rented accommodation, you'll need to ask around – cab drivers, shopkeepers, market traders, could all save you the estate agents' fees.\n\n\n== Learn ==\nThere are many colleges offering secretarial and computer courses in the CBDs of Nairobi and Mombasa.\nThere are also many universities, both public and private, and some participate in student exchange programs with international universities.\n\n\n== Work ==\nA high unemployment rate means work permits are required. These can be difficult to obtain unless you have specialized skills that are lacking in the workforce. You are best off being appointed abroad, as local employment opportunities are low-paying and few.\nThere are many international expatriates who work for non-profit agencies such as the UN and other affiliated agencies. Their pay is very high in relation to local living standards, and as a result their employees can afford to live in luxury.\nThere are numerous opportunities for volunteering in Kenya, whatever skills you have. Websites such as Idealist carry details of many of these placements, which could be centred on education, conservation, community development, or a number of similar areas. Kenya's English-speaking history and relative stability make it extremely well suited for this kind of work. In most cases, volunteering can be undertaken with a standard tourist visa, although it is worth checking with your host organization before travelling as the authorities may not always take this view.\nIf you have specialised skills, there are a number of more focused volunteering programs available. These range from opportunities for medical and engineering placements (for example, with MSF or VSO), to short sabbaticals for people with generic business experience, spent mentoring local businesses, with Skills Venture.\n\n\n== Stay safe ==\n\nAlthough Kenya is generally safe, it has had bouts of jihadist activities and occasional post-election violence.\nHomosexuality is against the law but is practised secretly. Overt displays of homosexuality (especially male to male relationships) may, at times, result in open hostility. Although violent reactions are quite uncommon, it is best to be discreet if engaging in any such activities with travel mates or locals. However, it is common to see people of the same gender hold hands while engaged in conversation. A new law, with penalties of 10 years of jail for many acts of homosexuality or discussing homosexuality is proposed in the spring of 2023, similar to ones in Ghana and Uganda.\nStay alert when walking or driving through Nairobi. You should always be careful to be aware of your surroundings and, if possible, ensure that you have a guide with you. Even daylight muggings on crowded streets are not uncommon. Infrequently, violent and sometimes fatal criminal attacks, including armed carjackings and home invasions/burglaries can occur at any time and in any location, particularly in Nairobi. Particularly avoid walking after dark. Take a taxi if you can afford it, or a bus if you cannot, but care should be taken as most buses, even modern ones, tend to be overcrowded and can pose dangers from pickpocketing.\nAvoid ostentatious displays of wealth. Objects most tempting to thieves are cameras, phones and electronics. The bus from the airport to downtown Nairobi is a notorious target for pickpockets.\nDo not ask for prices in English when buying anything, especially from hawkers and bodabodas. Chances are you will pay at least twice normal prices, no matter how good you are at haggling. Use the little Swahili you know so as not to overpay.\nIf you are unlucky and get mugged, a good tactic is to wave your arms and start screaming at the would-be mugger. Confrontations with armed robbers, however, should be avoided – in this instance, remember that your possessions are far less important than your life. Most criminals in Nairobi are more interested in a quick grab and dash than they are in a prolonged encounter. Since robbery is frequently punished by lengthy prison terms or even death, most muggers can be dissuaded by a good show of force. Like in any other city, it is perfectly possible to see, and enjoy, much of Nairobi without incident if you take sensible precautions.\nThe north of the country has a reputation for lawlessness, becoming more dangerous the closer you get to the South Sudanese, Ethiopian and Somali borders. Armed robberies and abductions by shiftas (bandits) on the roads in these areas are frequent. Avoid travelling to this part of the country if possible, and take special precautions if travelling by road. Armed convoys are normal for this part of the country. Visitors to Lake Turkana (indicated on the map as Lake Rudolf) in the northwest and Lamu in the northern end of the coast should travel there by air. Lodwar, Lokichokio ('Loki') and Moyale are towns best avoided by the casual traveller, unless you have business with the humanitarian organizations based there.\n\n\n== Stay healthy ==\nProtect yourself from mosquitoes, as they carry numerous diseases such as dengue fever, malaria and yellow fever. Get expert advice on malaria preventatives. Guard against mosquito bites. Wear long sleeves and long trousers and apply an effective insect repellent. If arriving from or travelling to other African countries, having a yellow fever vaccination certificate is typically mandatory. The vaccine can be administered at an affordable price at most reliable Nairobi clinics and hospitals.\nMalaria medications are recommended if you are travelling to rural areas (Nairobi is not within the malaria zone). The prophylactics most commonly used in this region are doxycycline (an antibiotic) and malarone (a combination of atovaquone and proguanil, also sold locally as malanil). Chloroquine is not as useful because of the high incidence of resistance and Mefloquine, also known as lariam, mefliam, and mephaquin, is associated with various side effects, including a high incidence of mood disturbances and a lower risk of severe neurological disturbance. Consult your physician and government health advisories for current advice.\nIf you get flu-like symptoms, including fever, joint aches and vomiting, consult a doctor immediately. If no doctor is available, take a treatment dose of an appropriate anti-malarial and go immediately to a hospital. While the public hospitals are slightly cheaper, long waits and poor conditions and care at these facilities may make it worthwhile to go to a private clinic. Costs will vary, but a typical trip to the hospital for malaria testing, doctor's consultation, and medication will cost US$12-30 depending on the clinic. As malaria can become serious, a trip to the hospital is recommended at the first symptoms of malaria.\nIf you get such symptoms within twelve months of returning home, seek a doctor's advice very quickly and immediately tell them where you have been in the last year. Delayed treatment, even by just a few hours, can lead to permanent brain and liver damage or death.\nDo not have unprotected sex as HIV/AIDS and other sexually transmitted diseases are a risk. The country's Adult HIV Prevalence rate (15th in the world) is over 6.1% or 1 in 16 adults. Voluntary Testing and Counselling (VCT) clinics offer free testing and counselling for HIV/AIDS.\nCholera is another danger. When in affected areas, see a doctor immediately and drink plenty of water.\nAll water should be treated, either by boiling or through purifying tablets or filters. This includes Nairobi as well as rural areas. Typhoid fever is a risk and, like malaria prophylactics, the vaccination is not 100% effective. It is advisable to buy bottled water for drinking. It is available countrywide. All fruits and vegetables should be thoroughly washed. While eating from the roadside kiosks is part of the cultural experience that one should not miss, such places do not always have the highest sanitary conditions and stomach illnesses can result.\n\n\n== Respect ==\n\nAlthough Kenya is predominantly Christian and somewhat liberal, there are areas with major Muslim influence, such at the Coastal regions, where it is considered indecent to wear short dresses. This is true in rural Christian areas as well. The locals, however, are extremely friendly.\nBeachwear is acceptable on the beach but not while strolling around town. Nudism and topless bathing are prohibited in Kenya. Even though some hotels allow topless or nude sunbathing, these are in restricted areas and not in public.\nKissing or heavy petting is frowned upon in public, even though Kenyan youth engage in both liberally in night clubs.\n\nPermission is required in order to take pictures of people, as a matter of etiquette. Photos of military and public facilities such as police stations, banks, ferries, etc. are typically prohibited.\nIf you are invited to a Kenyan home, it is proper to bring a small gift according to the occasion. If you are a white man and go out with Kenyans, you are expected to pay the bills. If you invite a Kenyan out to a pub or restaurant, you are also expected to pay their transport costs, especially if you are a man inviting a woman.\nIt is disrespectful to reject food offered to you. Always accept tea and chapati, or mandazi, which is very commonly offered to visitors.\nThe legacy of British colonial rule in Kenya is a sensitive subject, with the violent suppression of the 1950-62 Mau Mau uprising by the British government being a particularly sore spot among Kenyans. Tread carefully when discussing this with locals, and try to do more listening than talking. That being said, most Kenyans bear no animosity against regular British tourists, and you are unlikely to run into any problems so long as you are respectful and avoid political debates.\n\n\n== Connect ==\n\n\n=== Internet ===\nInternet cafés are common throughout Kenya and usually offer decent link quality. Expect prices of Ksh 0.50-1.00 per minute. Most cyber cafes now charge Ksh 1 per minute (2020).\n\n\n==== Mobile providers ====\nSafaricom, Airtel, Telkom: After purchasing a starter SIM card you may access the net instantly, if you have an Internet-capable handset or a modem. However, when using your account balance to pay for access, the prices are steep. It is much cheaper to purchase a data bundle, and the more expensive ones offer much better price/limit ratio. For example, in 2023, a 5GB data bundle good for one month costs Ksh 500 from Airtel, while a 5GB from Safaricom costs Ksh 1,000. A SIM card costs between Ksh 50-100.\nIn 2021, a sim card from Telkom was available for free from any of the Telkom promoters on the streets. A good data package from the same provider goes by the name of \"Mambo\" (Ksh 100 for 3GB, or Ksh 200 for 7.5 GB, valid for 30 days). Be aware that the reliability of Telkom is often poor and network coverage in rural areas non-existent.\nYou will be required to provide valid identification as it is required by law that all SIM cards be registered.\nYou may purchase the bundles by charging your account with scratch top-up cards and then dialing *100# or *544# (Safaricom and Airtel), *124# (Telkom). Once the data bundle is finished, continuing Internet access will consume your account balance (this behavior can be switched off for all providers).\n\n\n=== Wi-Fi hotspots ===\nAs of 2020, there's been an emergence in Wi-Fi hostspots in Kenya. These include Surf WiFi by Facebook and Moja WiFi that offer cheap internet connection in public places.\nMoja WiFi uses points that could be redeemed to access internet. A new user is awarded 50 points on registering on the network. A user gains points by watching video ads, one ad is equivalent to one point. For 5 points a user gets 24 hours of internet access.\nSurf WiFi offers cheap internet access. A new user is awarded free 1GB of internet bundle on registration. After that the user receives free 100MB daily by watching a video ad. When a person invites a new user using a referral link both receive 1GB of internet bundle upon registration of the new user. It also offers an app that has an inbuilt map that shows surf WiFi hostspots in the country and recharge shops to buy new bundles."}, "highlights": [], "created_at": 